# Taps
tap "homebrew/cask-fonts"

# Formulae
brew "terminal-notifier"
brew "gh"
brew "mas"
brew "duti"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks - Editor
cask "visual-studio-code"

# Casks - Web browsers
cask "firefox"
cask "brave-browser"
cask "arc"

# Casks - Design
cask "figma"

# Casks - Media
cask "sonos"
cask "vlc"

# Casks - Communications
cask "discord"

# Casks - Virtualisation
cask "virtualbox"

# Casks - Dev tools
cask "android-sdk"
cask "android-studio"
cask "charles"
cask "tower"
cask "dash"
cask "postman"

# Casks - OS improvements
cask "raycast"
cask "muzzle"
cask "rectangle"
cask "logi-options-plus"
cask "dropbox"
cask "licecap"

# Fonts
cask "font-material-icons"
cask "font-materialdesignicons-webfont"
cask "font-bebas-neue"
cask "font-oswald"
cask "font-monoid"
cask "font-fira-code"
cask "font-ibm-plex"
cask "font-b612"

# Mac App Store
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Visual Differ", id: 412386481
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Velja", id: 1607635845
