# Taps
tap "snyk/tap"

# Formulae
brew "awscli"
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "dockutil"
brew "duti"
brew "gh"
brew "gnupg"
brew "golangci-lint"
brew "k6"
brew "mas"
brew "openjdk"
brew "snyk/tap/snyk"
brew "terminal-notifier"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks - Editor
cask "visual-studio-code"

# Casks - Web browsers
cask "firefox"
cask "brave-browser"
cask "arc"

# Casks - Design
cask "figma"

# Casks - Media
cask "sonos"
cask "vlc"

# Casks - Communications
cask "discord"
cask "zoom"

# Casks - Virtualisation
cask "virtualbox"

# Casks - Dev tools
cask "android-studio"
cask "charles"
cask "tower"
cask "dash"
cask "postman"

# Casks - Security
cask "macpass"

# Casks - Screensaver
cask "aerial"

# Casks - OS improvements
cask "raycast"
cask "muzzle"
cask "rectangle"
cask "logi-options+"
cask "dropbox"
cask "licecap"

# Fonts
cask "font-material-icons"
cask "font-bebas-neue"
cask "font-oswald"
cask "font-monoid"
cask "font-fira-code"
cask "font-ibm-plex"
cask "font-b612"

# Mac App Store
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Visual Differ", id: 412386481
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Tailscale", id: 1475387142
mas "Velja", id: 1607635845
